<a href="https://colab.research.google.com/github/JPablo-R/datasciencecoursera/blob/master/1_CargaDeDatos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.-Carga de Datos
Lo primero que se va a realizar para una tarea de anal√≠tica de datos es cargar los datos a nuestro Jupyter Notebook.

In [1]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/Datasets/smallgradesh.csv"
df = pd.read_csv(Location, header=None)
df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

Si nuestro dataset no incluye headers, podemos agregarlos posteriormente.

In [2]:
import pandas as pd
location= "/content/drive/My Drive/Colab Notebooks/Datasets/smallgradesh.csv"

df= pd.read_csv(Location, names= ['Names', 'Grades'])
df.head()

     Names Grades
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

Cuando el dataframe no tiene headers, se puede utilizar df.columns

In [3]:
df.columns= ['Names', 'Grades']
df.head()

     Names Grades
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

**Tarea**
Importar los datos del censo de los EEUU para un estado en un dataframe. Los datos esta disponibles en: http://census.ire.org/data/bulkdata.html

In [4]:
# Aqu√≠ resuelve la tarea -------

Es posible guardar los datos de un dataframe que est√© en memoria a una hoja de calculo en formato CSV...

In [5]:
import pandas as pd
names= ['Bob', 'Jessica', 'Mary', 'John', 'Mel']
grades= [76,95,77,78,99]

GradeList= zip(names, grades)
df=pd.DataFrame(data= GradeList, columns= ['Names', 'Grades'])
df.to_csv('/content/drive/My Drive/Colab Notebooks/Output/studentgrades.csv', index=False, header=False)
df.head()

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

**Tarea**
Exportar a un archivo csv el **listado 2-8**

In [6]:
#Capturar aqu√≠ el listado 2-8 y resolver la exportaci√≥n a un archivo csv

In [8]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
Degrees = zip(names,grades,bsdegrees,msdegrees,phddegrees)
columns = ['Names','Grades','BS','MS','PhD']
df = pd.DataFrame(data = Degrees, columns=columns)
df.to_csv('/content/drive/My Drive/Colab Notebooks/Output/listado2-8.csv', index=False, header=False)
df.head()

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0

**Cargando datos a partir de Excel**

In [10]:
import pandas as pd
Location = "/content/drive/My Drive/Colab Notebooks/Datasets/gradedata.xlsx"
df = pd.read_excel(Location)
df.head()

     fname     lname  ... grade                                     address
0   Marcia      Pugh  ...  82.4        7379 Highland Rd. , Dublin, GA 31021
1   Kadeem  Morrison  ...  78.2          8 Bayport St. , Honolulu, HI 96815
2     Nash    Powell  ...  79.3           Encino, CA 91316, 3 Lilac Street
3  Noelani    Wagner  ...  83.2  Riverview, FL 33569, 9998 North Smith Dr.
4  Noelani    Cherry  ...  87.4   97 SE. Ocean Street , Bethlehem, PA 18015

[5 rows x 8 columns]

In [12]:
df.columns = ['first','last','sex','age','exer','hrs','grd','addr']
df.head()

     first      last  ...   grd                                        addr
0   Marcia      Pugh  ...  82.4        7379 Highland Rd. , Dublin, GA 31021
1   Kadeem  Morrison  ...  78.2          8 Bayport St. , Honolulu, HI 96815
2     Nash    Powell  ...  79.3           Encino, CA 91316, 3 Lilac Street
3  Noelani    Wagner  ...  83.2  Riverview, FL 33569, 9998 North Smith Dr.
4  Noelani    Cherry  ...  87.4   97 SE. Ocean Street , Bethlehem, PA 18015

[5 rows x 8 columns]

**Tarea: Cargar un archivo de Excel del censo de US**

**Guardar un Dataframe en Excel**

In [35]:
! pip install XlsxWriter

Requirement already satisfied: XlsxWriter in /usr/local/lib/python3.6/dist-packages (1.3.6)

In [37]:
import pandas as pd
import xlsxwriter
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

GradeList = zip(names,grades)

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])

writer = pd.ExcelWriter('/content/drive/My Drive/Colab Notebooks/Output/dataframe.xlsx', engine='xlsxwriter')

df.to_excel(writer, sheet_name='Sheet1')
writer.save()

**Tarea: Exportar el sigiuente codigo:**
import pandas as pd
names = ['Nike','Adidas','New Balance','Puma',‚ÄôReebok‚Äô]
grades = [176,59,47,38,99]
PriceList = zip(names,prices)
df = pd.DataFrame(data = PriceList, columns=['Names',‚ÄôPrices‚Äô])

**Combinando hojas de excel**

In [34]:
import pandas as pd
import numpy as np
all_data = pd.DataFrame()

df = pd.read_excel("/content/drive/My Drive/Colab Notebooks/Datasets/data1.xlsx")
all_data = all_data.append(df,ignore_index=True)

df = pd.read_excel("/content/drive/My Drive/Colab Notebooks/Datasets/data2.xlsx")
all_data = all_data.append(df,ignore_index=True)

df = pd.read_excel("/content/drive/My Drive/Colab Notebooks/Datasets/data3.xlsx")
all_data = all_data.append(df,ignore_index=True)
all_data.describe()

              age       grade
count  300.000000  300.000000
mean    16.456667   82.923333
std      1.700321   10.544576
min     14.000000   65.000000
25%     15.000000   73.750000
50%     16.000000   82.000000
75%     18.000000   92.000000
max     19.000000  100.000000

In [38]:
import pandas as pd
import numpy as np
import glob
all_data = pd.DataFrame()
for f in glob.glob("/content/drive/My Drive/Colab Notebooks/Datasets/data*.xlsx"):
 df = pd.read_excel(f)
 all_data = all_data.append(df,ignore_index=True)

all_data.describe()

              age       grade
count  300.000000  300.000000
mean    16.456667   82.923333
std      1.700321   10.544576
min     14.000000   65.000000
25%     15.000000   73.750000
50%     16.000000   82.000000
75%     18.000000   92.000000
max     19.000000  100.000000

**Tarea: **Crear un dataframe: In the datasets/weekly_call_data folder, there are 104 files of weekly call
data for two years. Your task is to try to load all of that data into one dataframe.

# **Creaci√≥n de n√∫meros aleatorios**

In [48]:
import pandas as pd
from numpy import random
from numpy.random import randint

names = ['Bob','Jessica','Mary','John','Mel']

random.seed(500)

randnames = []
for i in range(1000):
    name = names[randint(low=0,high=len(names))]
    randnames.append(name)
print(randnames)

['Mary', 'Jessica', 'Jessica', 'Bob', 'Jessica', 'Jessica', 'Jessica', 'Mary', 'Mary', 'Mary', 'John', 'Bob', 'Bob', 'Mary', 'Mary', 'John', 'Mel', 'Mary', 'Mel', 'John', 'John', 'Mel', 'Jessica', 'John', 'Jessica', 'Mary', 'Mary', 'John', 'Jessica', 'Bob', 'John', 'Jessica', 'Jessica', 'John', 'Bob', 'Mel', 'Jessica', 'Mel', 'Mel', 'Mary', 'Jessica', 'Mel', 'Mel', 'Mel', 'Mel', 'Bob', 'John', 'Jessica', 'Jessica', 'Bob', 'John', 'John', 'Jessica', 'Bob', 'Bob', 'John', 'John', 'John', 'Mel', 'Bob', 'Mel', 'Mel', 'Jessica', 'Mary', 'John', 'John', 'Bob', 'John', 'Mary', 'Bob', 'John', 'Mel', 'John', 'John', 'Bob', 'Mary', 'Bob', 'Jessica', 'Mel', 'Jessica', 'Bob', 'Mel', 'Bob', 'John', 'Jessica', 'Jessica', 'John', 'Bob', 'Bob', 'John', 'Bob', 'Jessica', 'Mel', 'John', 'Jessica', 'Mel', 'Jessica', 'Jessica', 'Mary', 'Mel', 'John', 'Mary', 'John', 'Bob', 'Mary', 'Jessica', 'Jessica', 'Mary', 'Mary', 'Jessica', 'John', 'Mel', 'Jessica', 'Bob', 'Mel', 'Jessica', 'John', 'John', 'Mel', 'Jessica', 'Mel', 'Jessica', 'Bob', 'Mel', 'Jessica', 'Jessica', 'Bob', 'Bob', 'Mel', 'Mel', 'Mary', 'John', 'Mary', 'Mary', 'Jessica', 'Mary', 'Mary', 'John', 'Mel', 'John', 'John', 'Mel', 'Mel', 'John', 'Jessica', 'Mel', 'Mel', 'John', 'Jessica', 'Jessica', 'Mel', 'Mel', 'Mel', 'Bob', 'Jessica', 'John', 'Mel', 'Mary', 'Bob', 'Jessica', 'John', 'Bob', 'Mel', 'Mel', 'Bob', 'John', 'Jessica', 'Bob', 'Bob', 'John', 'Mary', 'John', 'Mel', 'Jessica', 'Mel', 'John', 'Bob', 'Mary', 'Mel', 'Mary', 'Mary', 'Jessica', 'Jessica', 'John', 'Mel', 'Mary', 'Mary', 'John', 'Mary', 'Mel', 'Mary', 'Bob', 'Mel', 'Bob', 'Mary', 'Mel', 'Mary', 'Mary', 'Mel', 'Mary', 'John', 'Bob', 'Mary', 'Bob', 'Mary', 'Mel', 'Mary', 'Jessica', 'Mary', 'John', 'Bob', 'Jessica', 'Mary', 'Bob', 'Mel', 'Mary', 'Bob', 'Jessica', 'Mel', 'Bob', 'Mary', 'Mel', 'Jessica', 'Bob', 'John', 'Jessica', 'Jessica', 'Bob', 'Jessica', 'Bob', 'John', 'Bob', 'Jessica', 'Bob', 'Mary', 'Mary', 'Mary', 'John', 'John', 'Mel', 'Mel', 'Mary', 'Bob', 'John', 'John', 'Jessica', 'Jessica', 'Mel', 'Mary', 'Jessica', 'John', 'John', 'Mel', 'Jessica', 'Jessica', 'John', 'Mary', 'John', 'Bob', 'John', 'Mel', 'Mary', 'Jessica', 'Mel', 'John', 'Bob', 'John', 'Bob', 'Mary', 'Mary', 'Bob', 'Bob', 'Mel', 'John', 'Bob', 'Mary', 'Mary', 'John', 'Bob', 'Jessica', 'John', 'Bob', 'Mary', 'Mary', 'Mary', 'Mary', 'Bob', 'John', 'Mary', 'Jessica', 'Jessica', 'Jessica', 'Bob', 'John', 'Jessica', 'Mel', 'John', 'Mary', 'Mel', 'Bob', 'Jessica', 'Jessica', 'Jessica', 'Jessica', 'Mary', 'Mary', 'Jessica', 'Mel', 'John', 'Mary', 'John', 'John', 'Mary', 'Mary', 'Mel', 'Mel', 'Mel', 'John', 'Jessica', 'Mel', 'Jessica', 'Jessica', 'Mary', 'Jessica', 'Bob', 'Mary', 'Mary', 'Jessica', 'Mary', 'Jessica', 'Mel', 'John', 'John', 'Mel', 'Mel', 'Bob', 'Mel', 'John', 'Mary', 'Bob', 'Mary', 'Jessica', 'Bob', 'Mary', 'Jessica', 'Mel', 'Bob', 'Mel', 'Bob', 'Jessica', 'Bob', 'Jessica', 'Bob', 'John', 'John', 'Bob', 'Mary', 'Mary', 'Mary', 'John', 'John', 'John', 'Bob', 'Mel', 'Mel', 'Mel', 'Mary', 'Mel', 'Mary', 'Mary', 'Bob', 'Mel', 'Mel', 'Mary', 'Jessica', 'Bob', 'Jessica', 'Bob', 'Mel', 'Mel', 'Mary', 'Jessica', 'Jessica', 'Bob', 'Bob', 'Mel', 'Jessica', 'John', 'Mary', 'Mel', 'Bob', 'John', 'Jessica', 'John', 'Bob', 'Mary', 'Bob', 'Mary', 'Mary', 'Mel', 'Bob', 'Bob', 'Mel', 'Mel', 'Mary', 'Mel', 'Bob', 'Bob', 'Mary', 'Mel', 'Jessica', 'John', 'John', 'Mel', 'Mary', 'Mary', 'Bob', 'Mel', 'Mary', 'Mel', 'Bob', 'Bob', 'Mel', 'Mary', 'John', 'Jessica', 'Bob', 'Mary', 'Bob', 'Mary', 'John', 'Jessica', 'Mel', 'Bob', 'Bob', 'John', 'Mel', 'Jessica', 'Jessica', 'Mel', 'John', 'Bob', 'Mel', 'Bob', 'Mary', 'Jessica', 'Mel', 'Jessica', 'Bob', 'John', 'Mel', 'Bob', 'Mary', 'Mary', 'Jessica', 'Mel', 'Bob', 'Mary', 'Mary', 'Bob', 'Jessica', 'Bob', 'Jessica', 'Bob', 'Mary', 'Jessica', 'Bob', 'Mary', 'Jessica', 'Mary', 'Mary', 'Jessica', 'John', 'Jessica', 'Jessica', 'Mary', 'Mary', 'Mary', 'John', 'Jessica', 'John', 'Mary', 'Jessica', 'Mel', 'Bob', 'Mel', 'John', 'Mel', 'Jessica', 'John', 'John', 'Jessica', 'Bob', 'Mary', 'Mel', 'Mel', 'Jessica', 'Bob', 'Jessica', 'Mel', 'Jessica', 'Bob', 'Jessica', 'Mel', 'Mary', 'Mel', 'Bob', 'Bob', 'John', 'Jessica', 'Mary', 'Bob', 'Mary', 'Bob', 'Mel', 'Mel', 'John', 'Mary', 'Mel', 'John', 'Mel', 'Mary', 'Jessica', 'Bob', 'Jessica', 'Mel', 'Jessica', 'John', 'Jessica', 'Mary', 'Mel', 'Bob', 'John', 'Mary', 'Mel', 'Jessica', 'John', 'Mel', 'Bob', 'Mel', 'Mel', 'Mel', 'Mel', 'Bob', 'Mel', 'Mary', 'Jessica', 'Jessica', 'Mary', 'Mel', 'Mel', 'John', 'Bob', 'Mary', 'John', 'Jessica', 'Bob', 'Jessica', 'Mary', 'Mary', 'Bob', 'Mary', 'Bob', 'Jessica', 'Mel', 'Bob', 'Mary', 'John', 'Jessica', 'Mel', 'Mary', 'Mel', 'Mary', 'Mary', 'Bob', 'Bob', 'Mary', 'Jessica', 'Bob', 'Bob', 'John', 'John', 'Bob', 'Mary', 'Jessica', 'Jessica', 'Mary', 'Mary', 'Mary', 'Bob', 'Mel', 'Bob', 'Mel', 'Bob', 'Mel', 'John', 'Jessica', 'Bob', 'Mary', 'John', 'Jessica', 'John', 'John', 'Mary', 'Jessica', 'Jessica', 'John', 'Jessica', 'Jessica', 'Mel', 'Mary', 'Bob', 'John', 'Bob', 'Mary', 'Mary', 'Bob', 'Mary', 'Jessica', 'Mel', 'John', 'John', 'Jessica', 'Bob', 'John', 'Mary', 'Jessica', 'John', 'Jessica', 'Bob', 'Jessica', 'Mel', 'Bob', 'Mary', 'Mel', 'Mary', 'Mary', 'Mel', 'Mel', 'Mel', 'John', 'John', 'Jessica', 'Mary', 'Bob', 'Jessica', 'John', 'Mary', 'John', 'Mel', 'Bob', 'Bob', 'Bob', 'Jessica', 'Jessica', 'Bob', 'Bob', 'John', 'John', 'Mel', 'Mel', 'Bob', 'Bob', 'Mary', 'Mel', 'John', 'Mary', 'Jessica', 'Jessica', 'Mary', 'Bob', 'John', 'Mel', 'Bob', 'John', 'Mel', 'Bob', 'Bob', 'Mary', 'John', 'Mel', 'Bob', 'Mel', 'Jessica', 'Mel', 'Mel', 'Mel', 'Mel', 'John', 'John', 'Mel', 'Jessica', 'Bob', 'Bob', 'John', 'John', 'Jessica', 'John', 'Jessica', 'Mary', 'Bob', 'John', 'Jessica', 'Mary', 'John', 'Jessica', 'Bob', 'Jessica', 'John', 'Mary', 'Mel', 'Bob', 'Mary', 'Bob', 'Bob', 'Bob', 'John', 'Mel', 'Mel', 'Jessica', 'Mel', 'John', 'Bob', 'Bob', 'Mary', 'John', 'Jessica', 'Bob', 'Bob', 'Bob', 'Bob', 'Bob', 'Mel', 'Bob', 'Mel', 'Jessica', 'Mel', 'John', 'Bob', 'Mel', 'Jessica', 'John', 'Jessica', 'Bob', 'Mel', 'Bob', 'Mary', 'Mary', 'John', 'Mel', 'John', 'Jessica', 'Bob', 'Mel', 'Jessica', 'Jessica', 'Jessica', 'Bob', 'Mel', 'Jessica', 'Jessica', 'Mary', 'John', 'Bob', 'John', 'John', 'Jessica', 'Bob', 'Mary', 'Bob', 'Mel', 'John', 'Bob', 'Mary', 'Mel', 'Jessica', 'Bob', 'Mel', 'John', 'Bob', 'Mary', 'Mel', 'Jessica', 'Jessica', 'Mary', 'Bob', 'John', 'Mel', 'John', 'Mary', 'Mary', 'Mel', 'Bob', 'Bob', 'Bob', 'Bob', 'Mel', 'Jessica', 'Jessica', 'Mel', 'Mel', 'Mel', 'Mel', 'John', 'Mary', 'Bob', 'John', 'John', 'Jessica', 'Bob', 'Bob', 'Mel', 'Mary', 'Jessica', 'John', 'Mary', 'Bob', 'Jessica', 'Mary', 'Bob', 'John', 'Mel', 'Mel', 'Mary', 'Jessica', 'Mel', 'Bob', 'Jessica', 'John', 'Mary', 'Bob', 'Mel', 'John', 'John', 'John', 'Jessica', 'John', 'John', 'Bob', 'Jessica', 'Bob', 'Mary', 'Mary', 'Mary', 'Bob', 'Jessica', 'Mel', 'Bob', 'Mary', 'John', 'John', 'John', 'Mary', 'Bob', 'Jessica', 'Bob', 'Bob', 'Jessica', 'Mary', 'Mary', 'Mel', 'Bob', 'John', 'Jessica', 'Mary', 'Mary', 'Jessica', 'Mary', 'Mel', 'Bob', 'Mary', 'Bob', 'John', 'John', 'John', 'Jessica', 'John', 'Bob', 'Jessica', 'John', 'John', 'Mel', 'Mary', 'Mary', 'Mary', 'Mary', 'Jessica', 'Mary', 'John', 'Mel', 'Mary', 'Mel', 'Jessica', 'Bob', 'Bob', 'John', 'Mary', 'Mary', 'Bob', 'Bob', 'Mel', 'Mary', 'Mel', 'John', 'John', 'Bob', 'John', 'John', 'Mel', 'Mel', 'John', 'John', 'Bob', 'John', 'Mel', 'Jessica', 'Mel', 'John', 'John', 'Mel', 'Bob', 'Jessica', 'Jessica', 'Mel', 'Jessica', 'Jessica', 'Mary', 'Mel', 'Mary', 'Mary', 'Mel', 'John', 'Mel', 'John', 'Mel', 'Mel', 'John', 'John', 'Jessica', 'Mary', 'John', 'Jessica', 'Jessica', 'John', 'Mel', 'Mary', 'Mary', 'Mel', 'Mary', 'Mel', 'Mel', 'Jessica', 'Mary', 'Mel', 'Bob', 'Mary', 'Jessica', 'Jessica', 'Mary', 'Bob', 'Bob', 'Bob', 'Bob', 'Bob', 'Bob', 'John', 'Mel', 'Mary', 'Mary', 'John', 'Jessica', 'Jessica', 'Jessica', 'Mel', 'Bob', 'John', 'Mary', 'Bob', 'John', 'Mel', 'Jessica', 'John', 'John', 'Mel', 'Mary', 'Mel', 'Mel', 'Jessica', 'John', 'Mel', 'Jessica', 'John', 'Bob', 'Mel', 'Jessica', 'John', 'Jessica', 'John', 'Jessica', 'John']

In [49]:
births = []
for i in range(1000):
  births.append(randint(low=0, high=1000)) 
print(births)

[968, 155, 77, 578, 973, 124, 155, 403, 199, 191, 769, 88, 43, 393, 164, 45, 148, 609, 134, 726, 106, 355, 774, 214, 732, 362, 682, 141, 433, 892, 328, 151, 737, 200, 626, 679, 812, 481, 723, 98, 76, 911, 948, 698, 539, 806, 885, 785, 750, 233, 442, 170, 363, 913, 186, 510, 998, 12, 804, 705, 900, 727, 643, 34, 580, 287, 382, 5, 204, 392, 982, 809, 62, 220, 458, 738, 502, 352, 956, 326, 791, 724, 414, 51, 295, 463, 922, 693, 353, 378, 836, 10, 279, 778, 10, 370, 739, 682, 469, 324, 612, 721, 410, 474, 294, 128, 622, 588, 708, 286, 740, 112, 128, 195, 458, 828, 576, 726, 744, 449, 814, 678, 327, 837, 904, 592, 923, 245, 476, 120, 656, 511, 398, 716, 657, 358, 510, 129, 944, 490, 811, 734, 371, 37, 900, 723, 274, 291, 309, 143, 277, 116, 11, 49, 809, 28, 407, 937, 781, 236, 925, 423, 927, 925, 648, 481, 160, 375, 494, 623, 221, 378, 951, 556, 185, 434, 340, 474, 189, 606, 606, 331, 666, 105, 182, 137, 543, 860, 701, 564, 903, 471, 350, 797, 945, 912, 992, 203, 93, 18, 787, 543, 599, 616, 290, 388, 541, 906, 239, 269, 621, 607, 336, 775, 242, 962, 51, 24, 124, 976, 973, 988, 722, 969, 785, 446, 480, 616, 221, 578, 143, 74, 21, 994, 178, 946, 622, 978, 982, 651, 729, 836, 762, 860, 928, 363, 594, 752, 328, 934, 636, 921, 591, 583, 587, 30, 378, 562, 814, 623, 169, 959, 99, 629, 223, 353, 157, 915, 351, 206, 292, 401, 296, 693, 556, 905, 931, 825, 936, 366, 618, 394, 901, 355, 204, 34, 785, 551, 937, 210, 163, 175, 82, 855, 29, 70, 308, 745, 628, 271, 506, 599, 317, 934, 626, 706, 615, 688, 794, 71, 569, 981, 567, 285, 958, 859, 495, 119, 562, 279, 424, 330, 595, 187, 327, 186, 827, 708, 349, 39, 114, 647, 858, 645, 491, 447, 43, 449, 843, 416, 624, 101, 710, 451, 725, 814, 88, 250, 853, 373, 868, 419, 244, 137, 169, 24, 693, 910, 685, 319, 915, 645, 305, 495, 35, 26, 293, 476, 676, 517, 428, 729, 326, 18, 38, 661, 474, 697, 718, 96, 864, 217, 894, 922, 454, 390, 609, 761, 490, 480, 278, 71, 369, 176, 155, 58, 286, 347, 876, 532, 659, 779, 460, 543, 156, 142, 675, 992, 678, 10, 143, 311, 118, 67, 321, 262, 632, 4, 22, 551, 181, 664, 239, 601, 495, 482, 3, 363, 355, 983, 281, 236, 63, 97, 385, 276, 425, 539, 818, 46, 341, 461, 657, 511, 459, 246, 529, 685, 933, 901, 246, 953, 324, 122, 320, 500, 652, 382, 819, 967, 778, 781, 991, 694, 784, 632, 329, 881, 887, 412, 870, 715, 971, 372, 241, 421, 363, 407, 50, 415, 349, 657, 496, 817, 330, 393, 302, 392, 851, 615, 72, 404, 668, 91, 405, 805, 211, 552, 973, 467, 554, 533, 866, 233, 890, 844, 67, 762, 610, 196, 433, 254, 638, 775, 984, 466, 306, 450, 158, 378, 345, 741, 440, 724, 637, 505, 922, 560, 540, 964, 988, 381, 483, 989, 42, 952, 658, 167, 654, 684, 403, 399, 576, 540, 498, 661, 802, 364, 491, 953, 785, 558, 210, 744, 50, 616, 476, 276, 290, 778, 921, 224, 791, 393, 721, 274, 671, 520, 283, 715, 521, 729, 223, 141, 670, 20, 488, 958, 348, 883, 592, 341, 753, 541, 463, 905, 93, 217, 147, 317, 369, 468, 99, 506, 92, 245, 658, 47, 72, 610, 23, 449, 561, 500, 442, 547, 169, 913, 795, 249, 484, 480, 926, 357, 270, 606, 487, 201, 331, 840, 196, 515, 677, 860, 396, 647, 634, 677, 762, 977, 36, 84, 52, 532, 980, 226, 72, 124, 659, 430, 749, 334, 850, 397, 579, 725, 695, 369, 318, 731, 329, 128, 282, 613, 785, 647, 513, 215, 227, 389, 561, 862, 783, 863, 330, 12, 160, 208, 117, 737, 912, 538, 696, 214, 618, 833, 570, 28, 279, 140, 586, 987, 108, 317, 455, 256, 817, 59, 92, 257, 582, 490, 702, 382, 257, 756, 927, 142, 177, 497, 514, 166, 625, 19, 373, 471, 506, 520, 781, 494, 441, 380, 723, 428, 172, 586, 568, 742, 940, 677, 926, 438, 642, 747, 266, 993, 726, 650, 530, 910, 246, 316, 175, 429, 490, 875, 260, 576, 696, 148, 914, 506, 703, 908, 921, 260, 61, 874, 159, 504, 756, 964, 355, 326, 494, 448, 997, 141, 704, 39, 347, 346, 185, 254, 73, 946, 955, 751, 950, 478, 911, 989, 642, 223, 166, 166, 699, 548, 796, 182, 871, 643, 682, 276, 883, 77, 2, 604, 918, 517, 694, 799, 32, 978, 574, 279, 400, 688, 805, 617, 153, 139, 119, 44, 718, 421, 350, 552, 297, 328, 904, 186, 876, 367, 683, 11, 886, 493, 730, 412, 485, 794, 888, 487, 335, 504, 895, 629, 587, 874, 983, 820, 481, 136, 164, 67, 353, 242, 647, 202, 98, 846, 522, 188, 53, 193, 338, 101, 795, 652, 321, 104, 961, 860, 70, 425, 633, 883, 687, 348, 452, 758, 432, 458, 923, 129, 790, 215, 784, 738, 840, 874, 991, 218, 819, 556, 987, 916, 304, 200, 494, 455, 637, 608, 939, 909, 142, 778, 194, 3, 40, 888, 403, 430, 114, 624, 148, 160, 411, 552, 569, 311, 978, 423, 790, 712, 738, 403, 686, 542, 152, 721, 96, 896, 496, 644, 121, 614, 357, 252, 429, 969, 1, 354, 107, 615, 591, 517, 671, 758, 991, 565, 113, 564, 787, 562, 210, 207, 689, 66, 894, 348, 219, 928, 956, 227, 129, 608, 475, 973, 931, 16, 137, 271, 201, 124, 821, 29, 656, 959, 311, 834, 407, 879, 341, 813, 545, 505, 310, 222, 572, 639, 566, 739, 78, 150, 463, 715, 118, 122, 276, 54, 32, 931, 38, 353, 610, 954, 38, 161, 691, 865, 326, 677, 706, 151, 511, 756, 294, 152]

In [50]:
BabyDataSet2 = list(zip(randnames,births))
df = pd.DataFrame(data = BabyDataSet2, columns=['Names', 'Births'])
df

       Names  Births
0       Mary     968
1    Jessica     155
2    Jessica      77
3        Bob     578
4    Jessica     973
..       ...     ...
995     John     151
996  Jessica     511
997     John     756
998  Jessica     294
999     John     152

[1000 rows x 2 columns]

**TAREA: Create a dataframe called parkingtickets with 250 rows containing a
name and a number between 1 and 25.**